// 名称正则表达式。规则：1-64位字母、数字、汉字、减号、下划线的组合
export const NAME_REGEXP = /^[\w\u4e00-\u9fa5-]{1,64}$/;

// 不可包含中文正则表达式
export const NO_CHINESE_REGEXP = /^((?![\u4e00-\u9fa5]).)*$/;

// 管理员账号正则表达式
// 规则：1-16位字母、数字和下划线的组合
export const ACCOUNT_REGEXP = /^\w{1,16}$/;

// 密码正则表达式
// 规则：8-16位字母、数字和特殊符号，至少三种字符的组合
export const PWD_REGEXP =
  /^(?=.*[~!@#$%^&*()_\-+=<>?:"{}|,./;'\\[\]])(?=.*[a-zA-Z])(?=.*\d)[~!@#$%^&*()_\-+=<>?:"{}|,./;'\\[\]\w]{8,16}$/;

// MAC地址
// 规则：用`:`分隔。例如：87:89:90:54:12:30
export const MAC_REGEXP = /^([0-9a-fA-F]{2})(([:][0-9a-fA-F]{2}){5})$/;

// 手机号正则表达式
export const MOBILE_REGEXP = /^1[3-9]\d{9}$/;

// 浮点数表达式
export const FLOAT_REGEXP = /^(-?\d+)(\.\d+)?$/;

// 整数表达式
export const INT_REGEXP = /^\d+$/;

// 正整数表达式
export const POSITIVE_INT_REGEXP = /^[1-9]\d*$/;

// IPv4 规则正则表达式
export const IPV4_REGEXP = /^(25[0-5]|2[0-4]\d|[0-1]?\d?\d)(\.(25[0-5]|2[0-4]\d|[0-1]?\d?\d)){3}$/;

// IP/Mask 规则正则表达式，Mask可选值：8、16、24和32
export const IPMASK_REGEXP =
  /^(25[0-5]|2[0-4]\d|[0-1]?\d?\d)(\.(25[0-5]|2[0-4]\d|[0-1]?\d?\d)){3}(\/(8|16|24|32))?$/;

// IPv6 规则正则表达式
export const IPV6_REGEXP =
  /^((([0-9A-Fa-f]{1,4}:){7}([0-9A-Fa-f]{1,4}|:))|(([0-9A-Fa-f]{1,4}:){6}(:[0-9A-Fa-f]{1,4}|((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3})|:))|(([0-9A-Fa-f]{1,4}:){5}(((:[0-9A-Fa-f]{1,4}){1,2})|:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3})|:))|(([0-9A-Fa-f]{1,4}:){4}(((:[0-9A-Fa-f]{1,4}){1,3})|((:[0-9A-Fa-f]{1,4})?:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:))|(([0-9A-Fa-f]{1,4}:){3}(((:[0-9A-Fa-f]{1,4}){1,4})|((:[0-9A-Fa-f]{1,4}){0,2}:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:))|(([0-9A-Fa-f]{1,4}:){2}(((:[0-9A-Fa-f]{1,4}){1,5})|((:[0-9A-Fa-f]{1,4}){0,3}:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:))|(([0-9A-Fa-f]{1,4}:){1}(((:[0-9A-Fa-f]{1,4}){1,6})|((:[0-9A-Fa-f]{1,4}){0,4}:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:))|(:(((:[0-9A-Fa-f]{1,4}){1,7})|((:[0-9A-Fa-f]{1,4}){0,5}:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:)))(%.+)?$/;

// DNS 关键字列表正则表达式
export const DNS_KEYWORDS_REGEXP = /^[a-zA-Z0-9-.\u4e00-\u9fa5]{1,63}$/;

// HTTP header过滤禁止关键字正则表达式
export const HTTPHEADER_KEYWORD_REGEXP = /^[^\u4e00-\u9fa5]{1,255}$/;

// HH:mm:ss 格式时间表达式
export const TIME_REGEXP = /^([0-1][0-9]|2[0-3]):([0-5][0-9]):([0-5][0-9])$/;

// 所有后缀名格式的文件
export const FILE_REGEXP = /^[\s\S]*\.[a-zA-Z]{1,}$/;

// DNS过滤名称 1-64位字母，数字，汉字和下划线的组合
export const DNSNAME_REGEXP = /^[a-zA-Z0-9\u4E00-\u9FA5_]{1,64}$/;

// SMTP备注规则 不超过255个字符，不得含有',”,`,?非法字符
export const SMTP_COMMENT = /^^['"`?]{1,255}$/;

// 域名正则表达式
// 域名规则：
// 1. 顶级域名由2-6位字母组成；
// 2. 其他级域名可由字母、数字和`-`组成，但是不能以`-`开头或结尾，长度范围1-63
// 3. 各级域名用`.`分隔
export const DOMAIN_REGEXP = /^((?!-)[A-Za-z0-9-]{1,63}(?<!-)\.)+[A-Za-z]{2,6}$/; // IE浏览器不支持反向否定预查?<!

// 邮箱正则表达式
// 邮箱规则：
// 1. 邮箱域名部分规则，同域名规则；
// 2. 邮箱前缀规则：可由字母、数字和`_`和`.`组成，但是只能以字母和数字开头，长度范围2-32
// 3. 邮箱前缀和邮箱域名用`@`分隔
export const EMAIL_REGEXP = /^[A-Za-z0-9][\w.]{1,31}@((?!-)[A-Za-z0-9-]{1,63}(?<!-)\.)+[A-Za-z]{2,6}$/; // IE浏览器不支持反向否定预查?<!
